tap 'homebrew/bundle'
tap 'homebrew/services'

# Eessentials
brew 'gcc'
brew 'ripgrep'
brew 'coreutils'
brew 'fd'
brew 'cmake'
brew 'tree-sitter'

# Utilities
brew 'bat'
brew 'btop'
brew 'eza'
brew 'fd'
brew 'fzf'
brew 'git'
brew 'tldr'
brew 'wget'
brew 'zoxide'
brew 'yazi'
brew 'lazygit'

# Shell
brew 'starship'
brew 'tmux'
brew 'zsh-autosuggestions'

# Bun
tap 'oven-sh/bun'
brew 'oven-sh/bun/bun'

# Python
brew 'pyenv'

# Ruby
brew 'rbenv'
brew 'ruby-build'

# Node
brew 'nvm'

# Emacs
# tap 'd12frosted/emacs-plus'
# brew 'd12frosted/emacs-plus/emacs-plus@29', args: %w[with-native-comp with-poll]

# Wezterm
cask 'wezterm'

# Yabai and skhd
# tap 'koekeishiya/formulae'
# brew 'koekeishiya/formulae/yabai'
# brew 'koekeishiya/formulae/skhd'
#
# tap 'FelixKratz/formulae'
# brew 'FelixKratz/formulae/sketchybar'
# brew 'FelixKratz/formulae/borders'

# Terraform
tap 'hashicorp/tap'
brew 'hashicorp/tap/terraform'

# Fonts
cask 'font-jetbrains-mono'
cask 'font-jetbrains-mono-nerd-font'
