tap 'homebrew/bundle'
tap 'homebrew/services'

# Eessentials
brew 'gcc'
brew 'ripgrep'
brew 'coreutils'
brew 'fd'
brew 'cmake'

# Bun
tap 'oven-sh/bun'
brew 'oven-sh/bun/bun'

# Python
brew 'pyenv'

# Ruby
brew 'rbenv'
brew 'ruby-build'

# Emacs
tap 'd12frosted/emacs-plus'
brew 'd12frosted/emacs-plus/emacs-plus@29', args: %w[with-native-comp with-poll]

# Terraform
tap 'hashicorp/tap'
brew 'hashicorp/tap/terraform'

# Utilities
brew 'zellij'
brew 'fzf'
brew 'git'
brew 'wget'
brew 'z'
